Repository: KDE/libkomparediff2
Catalog: po/*/libkomparediff2.po
Languages: be, eo, ia

# @action
source: &Apply Difference
be: &Ужыць адрозненне
eo: &Apliki Diferencon
ia: &Applica Differentia

# @action
source: Un&apply Difference
be: Прыбр&аць адрозненне
eo: Mal&apliki Diferencon
ia: Dis&applica Differentia

# @action
source: App&ly All
be: Ужы&ць усё
eo: Ap&liki Ĉiujn
ia: App&lica Omne

# @action
source: &Unapply All
be: &Прыбраць усё
eo: Malapliki Ĉi&ujn
ia: &Disapplica Omne

# @action
source: P&revious File
be: &Папярэдні файл
eo: Antaŭa Dosie&ro
ia: P&revie File

# @action
source: N&ext File
be: &Наступны файл
eo: S&ekva Dosiero
ia: Proxim&e File

# @action
source: &Previous Difference
be: П&апярэдняе адрозненне
eo: &Antaŭa Diferenco
ia: &Previe Differentia

# @action
source: &Next Difference
be: На&ступнае адрозненне
eo: Sekva Difere&nco
ia: Pro&xime Differentia

source: <qt>No models or no differences, this file: <b>%1</b>, is not a valid diff file.</qt>
be: <qt>Няма мадэляў або адрозненняў. Файл <b>%1</b> не ёсць сапраўдным файлам адрозненняў.</qt>
eo: <qt>Neniuj modeloj aŭ neniuj diferencoj, ĉi tiu dosiero: <b>%1</b>, ne estas valida diff-dosiero.</qt>
ia: <qt>Nulle modellos o nulle differentias, iste file: <b>%1</b>, non es un valide file de diff.</qt>

source: <qt>There were problems applying the diff <b>%1</b> to the file <b>%2</b>.</qt>
be: <qt>Пры ўжыванні адрознення <b>%1</b> да файла <b>%2</b> паўсталі праблемы.</qt>
eo: <qt>Estis problemoj apliki la diff-on <b>%1</b> al la dosiero <b>%2</b>.</qt>
ia: <qt>Il habeva problemas a applicar le diff <b>%1</b> al file <b>%2</b>.</qt>

source: <qt>There were problems applying the diff <b>%1</b> to the folder <b>%2</b>.</qt>
be: <qt>Пры ўжыванні адрознення <b>%1</b> да каталога <b>%2</b> паўсталі праблемы.</qt>
eo: <qt>Estis problemoj apliki la diff-on <b>%1</b> al la dosierujo <b>%2</b>.</qt>
ia: <qt>Il habeva problemas a applicar le diff <b>%1</b> al dossier <b>%2</b>. </qt>

source: Could not open a temporary file.
be: Не ўдалося адкрыць часовы файл.
eo: Ne eblis malfermi dumtempan dosieron.
ia: Il non pote aperir un file temporanee.

source: <qt>Could not write to the temporary file <b>%1</b>, deleting it.</qt>
be: <qt>Немагчыма запісаць у часовы файл <b>%1</b>, файл будзе выдалены.</qt>
eo: <qt>Ne eblis skribi al dumtempa dosiero <b>%1</b>, forigante ĝin.</qt>
ia: <qt>Non pote scriber in file temporanee <b>%1</b>, on dele illo.</qt>

source: <qt>Could not create destination directory <b>%1</b>. The file has not been saved.</qt>
be: <qt>Не ўдалося стварыць мэтавы каталог <b>%1</b>. Файл не быў захаваны.</qt>
eo: <qt>Ne eblis krei celdosierujon <b>%1</b>. La dosiero ne estis konservita</qt>
ia: <qt>Nonpoteva crear directorio de destination <b>%1</b>. Le file non ha essite salveguardate.</qt>

source: <qt>Could not upload the temporary file to the destination location <b>%1</b>. The temporary file is still available under: <b>%2</b>. You can manually copy it to the right place.</qt>
be: <qt>Не ўдалося запампаваць часовы файл у мэтавае размяшчэнне <b>%1</b>. часовы файл усё яшчэ даступны: <b>%2</b>. Вы можаце ўласнаручна скапіяваць яго ў патрэбнае размяшчэнне.</qt>
eo: <qt>Ne eblis alŝuti la provizoran dosieron al la celloko <b>%1</b>. La dumtempa dosiero ankoraŭ disponeblas sub: <b>%2</b>. Vi povas permane kopii ĝin al la ĝusta loko.</qt>
ia: <qt>Nonpoteva incargar le file temporanee al location de destination <b>%1</b>. Le file temporanee es ancora disponibile sub: <b>%2</b>. Tu pote copiar lo manualmente in le loco correcte.</qt>

source: Could not parse diff output.
be: Не ўдалося прааналізаваць вывад адрознення.
eo: Ne eblis analizi diff-eligon.
ia: Non poteva analysar le exito de diff.

source: The files are identical.
be: Файлы аднолькавыя.
eo: La dosieroj estas identaj.
ia: Le files es identic.

source: Could not write to the temporary file.
be: Не ўдалося запісаць у часовы файл.
eo: Ne eblis skribi al provizora dosiero.
ia: Non poteva scriber in le file temporanee.

source: The diff is malformed. Some lines could not be parsed and will not be displayed in the diff view.
be: Адрозненне няправільнае. Некаторыя радкі не ўдалося прааналізаваць, яны не будуць паказвацца пры праглядзе.
eo: La diferenco estas misformita. Kelkaj linioj ne povis esti analizitaj kaj ne estos montrataj en la diff-vido.
ia: Le diff es mal formate. Alcun lineas non pote esser analysate e non essera monstrate in le vista de diff.
